Revit 2017 API
DirectShape.CreateElementInstance Method (Document, ElementId, ElementId, String, Transform, String, String)
 Creates a DirectShape object and adds it to document. The shape stored in the element is either a reference or a copy of a definition shape that was created earlier. How the definitions are stored will determine whether an instance or a copy of the shape will be created. See DirectShapeLibrary for more details. This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute("This function will be obsolete in Revit 2017. Use the other DirectShape.CreateElementInstance instead. Use DirectShape.ApplicationId, DirectShape.ApplicationDataId properties to set application id and application data id.")]
public static DirectShape CreateElementInstance(
	Document document,
	ElementId typeId,
	ElementId categoryId,
	string definitionId,
	Transform trf,
	string applicationId,
	string applicationDataId
)
Visual Basic
<ObsoleteAttribute("This function will be obsolete in Revit 2017. Use the other DirectShape.CreateElementInstance instead. Use DirectShape.ApplicationId, DirectShape.ApplicationDataId properties to set application id and application data id.")> _
Public Shared Function CreateElementInstance ( _
	document As Document, _
	typeId As ElementId, _
	categoryId As ElementId, _
	definitionId As String, _
	trf As Transform, _
	applicationId As String, _
	applicationDataId As String _
) As DirectShape
Visual C++
[ObsoleteAttribute(L"This function will be obsolete in Revit 2017. Use the other DirectShape.CreateElementInstance instead. Use DirectShape.ApplicationId, DirectShape.ApplicationDataId properties to set application id and application data id.")]
public:
static DirectShape^ CreateElementInstance(
	Document^ document,
	ElementId^ typeId,
	ElementId^ categoryId,
	String^ definitionId,
	Transform^ trf,
	String^ applicationId,
	String^ applicationDataId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document to which the created element will be added.
typeId
Type: Autodesk.Revit.DB.ElementId
 Element id of a DirectShapeType element.
categoryId
Type: Autodesk.Revit.DB.ElementId
 Id of the category assigned to this DirectShape. Must be a valid category id.
definitionId
Type: System.String
 Id of the shape definition that was created earlier and stored via DirectShapeLibrary.
trf
Type: Autodesk.Revit.DB.Transform
 Transform to be applied to the definition
applicationId
Type: System.String
 A text string that identifies the creating application. May not be empty.
applicationDataId
Type: System.String
 An optional text string that identifies the data to the creating application. The intended use is to identify the native data that was the source of this DirectShape.
Return Value
 The created DirectShape object.
Remarks
 This is intended to support a definition/instance pattern common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem. Use DirectShapeLibrary class to store definitions prior to using them here.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Document document may not contain DirectShape or DirectShapeType objects. -or- Element id categoryId may not be used as a DirectShape category.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
DirectShape Class
CreateElementInstance Overload
Autodesk.Revit.DB Namespace